[
    {
        "title": "Bilinear interpolation",
        "content": [
            "In mathematics, bilinear interpolation is a method for interpolating functions of two variables (e.g., x and y) using repeated linear interpolation. It is usually applied to functions sampled on a 2D rectilinear grid, though it can be generalized to functions defined on the vertices of (a mesh of) arbitrary convex quadrilaterals.",
            "Bilinear interpolation is performed using linear interpolation first in one direction, and then again in another direction. Although each step is linear in the sampled values and in the position, the interpolation as a whole is not linear but rather quadratic in the sample location.",
            "Bilinear interpolation is one of the basic resampling techniques in computer vision and image processing, where it is also called bilinear filtering or bilinear texture mapping.",
            "Suppose that we want to find the value of the unknown function f at the point (x, y). It is assumed that we know the value of f at the four points Q11 = (x1, y1), Q12 = (x1, y2), Q21 = (x2, y1), and Q22 = (x2, y2).",
            "We first do linear interpolation in the x-direction. This yields",
            "We proceed by interpolating in the y-direction to obtain the desired estimate:",
            "Note that we will arrive at the same result if the interpolation is done first along the y direction and then along the x direction.[1]",
            "An alternative way is to write the solution to the interpolation problem as a multilinear polynomial",
            "where the coefficients are found by solving the linear system",
            "yielding the result",
            "The solution can also be written as a weighted mean of the f(Q):",
            "where the weights sum to 1 and satisfy the transposed linear system",
            "yielding the result",
            "which simplifies to",
            "in agreement with the result obtained by repeated linear interpolation. The set of weights can also be interpreted as a set of generalized barycentric coordinates for a rectangle.",
            "Combining the above, we have",
            "If we choose a coordinate system in which the four points where f is known are (0, 0), (0, 1), (1, 0), and (1, 1), then the interpolation formula simplifies to",
            "or equivalently, in matrix operations:",
            "Here we also recognize the weights:",
            "Alternatively, the interpolant on the unit square can be written as",
            "where",
            "In both cases, the number of constants (four) correspond to the number of data points where f is given.",
            "As the name suggests, the bilinear interpolant is not linear; but it is linear (i.e. affine) along lines parallel to either the x or the y direction, equivalently if x or y is held constant. Along any other straight line, the interpolant is quadratic. Even though the interpolation is not linear in the position (x and y), at a fixed point it is linear in the interpolation values, as can be seen in the (matrix) equations above.",
            "The result of bilinear interpolation is independent of which axis is interpolated first and which second. If we had first performed the linear interpolation in the y direction and then in the x direction, the resulting approximation would be the same.",
            "The interpolant is a bilinear polynomial, which is also a harmonic function satisfying Laplace's equation. Its graph is a bilinear Bézier surface patch.",
            "In general, the interpolant will assume any value (in the convex hull of the vertex values) at an infinite number of points (forming branches of hyperbolas[2]), so the interpolation is not invertible.",
            "However, when bilinear interpolation is applied to two functions simultaneously, such as when interpolating a vector field, then the interpolation is invertible (under certain conditions). In particular, this inverse can be used to find the \"unit square coordinates\" of a point inside any convex quadrilateral (by considering the coordinates of the quadrilateral as a vector field which is bilinearly interpolated on the unit square). Using this procedure bilinear interpolation can be extended to any convex quadrilateral, though the computation is significantly more complicated if it is not a parallelogram.[3] The resulting map between quadrilaterals is known as a bilinear transformation, bilinear warp or bilinear distortion.",
            "Alternatively, a projective mapping between a quadrilateral and the unit square may be used, but the resulting interpolant will not be bilinear.",
            "In the special case when the quadrilateral is a parallelogram, a linear mapping to the unit square exists and the generalization follows easily.",
            "The obvious extension of bilinear interpolation to three dimensions is called trilinear interpolation.",
            "Let \n\n\n\nF\n\n\n{\\textstyle F}\n\n be a vector field that is bilinearly interpolated on the unit square parameterized by \n\n\n\nμ\n,\nλ\n∈\n[\n0\n,\n1\n]\n\n\n{\\textstyle \\mu ,\\lambda \\in [0,1]}\n\n. Inverting the interpolation requires solving a system of two bilinear polynomial equations:\n\n\n\nA\n+\nB\nλ\n+\nC\nμ\n+\nD\nλ\nμ\n=\n0\n\n\n{\\displaystyle A+B\\lambda +C\\mu +D\\lambda \\mu =0}\n\nwhere \n\n\n\n\n\n\n\nA\n\n\n\n=\n\nF\n\n00\n\n\n−\nF\n\n\n\n\nB\n\n\n\n=\n\nF\n\n10\n\n\n−\n\nF\n\n00\n\n\n\n\n\n\nC\n\n\n\n=\n\nF\n\n01\n\n\n−\n\nF\n\n00\n\n\n\n\n\n\nD\n\n\n\n=\n\nF\n\n11\n\n\n−\n\nF\n\n01\n\n\n−\n\nF\n\n10\n\n\n+\n\nF\n\n00\n\n\n\n\n\n\n\n\n{\\displaystyle {\\begin{aligned}A&=F_{00}-F\\\\B&=F_{10}-F_{00}\\\\C&=F_{01}-F_{00}\\\\D&=F_{11}-F_{01}-F_{10}+F_{00}\\end{aligned}}}\n\nTaking a 2-d cross product (see Grassman product) of the system with a carefully chosen vectors allows us to eliminate terms:\n\n\n\n\n\n\n\n(\nA\n+\nB\nλ\n+\nC\nμ\n)\n\n\n\n×\nD\n\n\n=\n0\n\n\n\n\n(\nA\n+\nB\nλ\n)\n\n\n\n×\n(\nC\n+\nD\nλ\n)\n\n\n=\n0\n\n\n\n\n(\nA\n+\nC\nμ\n)\n\n\n\n×\n(\nB\n+\nD\nμ\n)\n\n\n=\n0\n\n\n\n\n\n\n{\\displaystyle {\\begin{aligned}(A+B\\lambda +C\\mu )&\\times D&=0\\\\(A+B\\lambda )&\\times (C+D\\lambda )&=0\\\\(A+C\\mu )&\\times (B+D\\mu )&=0\\\\\\end{aligned}}}\n\nwhich expands to\n\n\n\n\n\n\n\nc\n+\ne\nλ\n+\nf\nμ\n\n\n\n=\n0\n\n\n\n\nb\n+\n(\nc\n+\nd\n)\nλ\n+\ne\n\nλ\n\n2\n\n\n\n\n\n=\n0\n\n\n\n\na\n+\n(\nc\n−\nd\n)\nμ\n+\nf\n\nμ\n\n2\n\n\n\n\n\n=\n0\n\n\n\n\n\n\n{\\displaystyle {\\begin{aligned}c+e\\lambda +f\\mu &=0\\\\b+(c+d)\\lambda +e\\lambda ^{2}&=0\\\\a+(c-d)\\mu +f\\mu ^{2}&=0\\\\\\end{aligned}}}\n\nwhere\n\n\n\n\n\n\n\na\n\n\n\n=\nA\n×\nB\n\n\n\n\nb\n\n\n\n=\nA\n×\nC\n\nd\n=\nB\n×\nC\n\n\n\n\nc\n\n\n\n=\nA\n×\nD\n\ne\n=\nB\n×\nD\n\nf\n=\nC\n×\nD\n\n\n\n\n\n\n{\\displaystyle {\\begin{aligned}a&=A\\times B\\\\b&=A\\times C\\qquad d=B\\times C\\\\c&=A\\times D\\qquad e=B\\times D\\qquad f=C\\times D\\end{aligned}}}\n\nThe quadratic equations can be solved using the quadratic formula. We have the equivalent determinants \n\n\n\n\nD\n\n=\n(\nc\n+\nd\n\n)\n\n2\n\n\n−\n4\ne\nb\n=\n(\nc\n−\nd\n\n)\n\n2\n\n\n−\n4\nf\na\n\n\n{\\displaystyle \\mathbb {D} =(c+d)^{2}-4eb=(c-d)^{2}-4fa}\n\nand the solutions\n\n\n\nλ\n=\n\n\n\n−\nc\n−\nd\n±\n\n\n\nD\n\n\n\n\n\n2\ne\n\n\n\n\nμ\n=\n\n\n\n−\nc\n+\nd\n∓\n\n\n\nD\n\n\n\n\n\n2\nf\n\n\n\n\n\n{\\displaystyle \\lambda ={\\frac {-c-d\\pm {\\sqrt {\\mathbb {D} }}}{2e}}\\qquad \\mu ={\\frac {-c+d\\mp {\\sqrt {\\mathbb {D} }}}{2f}}}\n\n(opposite signs are enforced by the linear relation). The cases when \n\n\n\ne\n=\n0\n\n\n{\\displaystyle e=0}\n\n or \n\n\n\nf\n=\n0\n\n\n{\\displaystyle f=0}\n\n must be handled separately. Given the right conditions, one of the two solutions should be in the unit square.",
            "In computer vision and image processing, bilinear interpolation is used to resample images and textures. An algorithm is used to map a screen pixel location to a corresponding point on the texture map. A weighted average of the attributes (color, transparency, etc.) of the four surrounding texels is computed and applied to the screen pixel. This process is repeated for each pixel forming the object being textured.[4]",
            "When an image needs to be scaled up, each pixel of the original image needs to be moved in a certain direction based on the scale constant. However, when scaling up an image by a non-integral scale factor, there are pixels (i.e., holes) that are not assigned appropriate pixel values. In this case, those holes should be assigned appropriate RGB or grayscale values so that the output image does not have non-valued pixels.",
            "Bilinear interpolation can be used where perfect image transformation with pixel matching is impossible, so that one can calculate and assign appropriate intensity values to pixels. Unlike other interpolation techniques such as nearest-neighbor interpolation and bicubic interpolation, bilinear interpolation uses values of only the 4 nearest pixels, located in diagonal directions from a given pixel, in order to find the appropriate color intensity values of that pixel.",
            "Bilinear interpolation considers the closest 2 × 2 neighborhood of known pixel values surrounding the unknown pixel's computed location. It then takes a weighted average of these 4 pixels to arrive at its final, interpolated value.[5][6]",
            "As seen in the example on the right, the intensity value at the pixel computed to be at row 20.2, column 14.5 can be calculated by first linearly interpolating between the values at column 14 and 15 on each rows 20 and 21, giving",
            "and then interpolating linearly between these values, giving",
            "This algorithm reduces some of the visual distortion caused by resizing an image to a non-integral zoom factor, as opposed to nearest-neighbor interpolation, which will make some pixels appear larger than others in the resized image.",
            "This example is of tabularised pressure (columns) vs temperature (rows) data as a lookup against some variable:",
            "The following standard calculation by parts has 18 required operations:",
            "This can all be simplified from the initial 18 individual operations to 16 individual operations as such:",
            "The above has two repeated operations: \n\n\n\n(\n\nP\n\n2\n\n\n−\n\nP\n\nx\n\n\n)\n\n\n{\\displaystyle (P_{2}-P_{x})}\n\n and \n\n\n\n(\n\nP\n\nx\n\n\n−\n\nP\n\n1\n\n\n)\n.\n\n\n{\\displaystyle (P_{x}-P_{1}).}\n\n\nThese two repetitions can be assigned temporary variables whilst computing a single interpolation, which will reduce the number of calculations down to 14 operations, which is the minimum number of steps required for producing the desired interpolation. Doing this interpolation in 14 rather than 18 operations makes it 22% more efficient.",
            "Simplification of terms is good practice for application of mathematical methodology to engineering applications and can reduce computational and energy requirements for a process.[citation needed]"
        ]
    },
    {
        "title": "Quadrilateral",
        "content": [
            "In  geometry  a quadrilateral is a four-sided polygon, having four edges (sides) and four corners (vertices). The word is derived from the Latin words quadri, a variant of four, and latus, meaning \"side\". It is also called a tetragon, derived from Greek \"tetra\" meaning \"four\" and \"gon\" meaning \"corner\" or \"angle\", in analogy to other polygons (e.g. pentagon). Since \"gon\" means \"angle\", it is analogously called a quadrangle, or 4-angle. A quadrilateral with vertices \n\n\n\nA\n\n\n{\\displaystyle A}\n\n, \n\n\n\nB\n\n\n{\\displaystyle B}\n\n, \n\n\n\nC\n\n\n{\\displaystyle C}\n\n and \n\n\n\nD\n\n\n{\\displaystyle D}\n\n is sometimes denoted as \n\n\n\n◻\nA\nB\nC\nD\n\n\n{\\displaystyle \\square ABCD}\n\n.[1]",
            "Quadrilaterals are either simple (not self-intersecting), or complex (self-intersecting, or crossed). Simple quadrilaterals are either convex or concave.",
            "The interior angles of a simple (and planar) quadrilateral ABCD add up to 360 degrees, that is[1]",
            "This is a special case of the n-gon interior angle sum formula: S = (n − 2) × 180° (here, n=4).[2]",
            "All non-self-crossing quadrilaterals tile the plane, by repeated rotation around the midpoints of their edges.[3]",
            "Any quadrilateral that is not self-intersecting is a simple quadrilateral.",
            "In a convex quadrilateral all interior angles are less than 180°, and the two diagonals both lie inside the quadrilateral.",
            "",
            "In a concave quadrilateral, one interior angle is bigger than 180°, and one of the two diagonals lies outside the quadrilateral.",
            "A self-intersecting quadrilateral is called variously a cross-quadrilateral, crossed quadrilateral, butterfly quadrilateral or bow-tie quadrilateral. In a crossed quadrilateral, the four \"interior\" angles on either side of the crossing (two acute and two reflex, all on the left or all on the right as the figure is traced out) add up to 720°.[10]",
            "The two diagonals of a convex quadrilateral are the line segments that connect opposite vertices.",
            "The two bimedians of a convex quadrilateral are the line segments that connect the midpoints of opposite sides.[12] They intersect at the \"vertex centroid\" of the quadrilateral (see § Remarkable points and lines in a convex quadrilateral below).",
            "The four maltitudes of a convex quadrilateral are the perpendiculars to a side—through the midpoint of the opposite side.[13]",
            "There are various general formulas for the area K of a convex quadrilateral ABCD with sides a =  AB, b = BC, c = CD and d = DA.",
            "The area can be expressed in trigonometric terms as[14]",
            "where the lengths of the diagonals are p and q and the angle between them is θ.[15] In the case of an orthodiagonal quadrilateral (e.g. rhombus, square, and kite), this formula reduces to \n\n\n\nK\n=\n\n\n\n\np\nq\n\n2\n\n\n\n\n\n{\\displaystyle K={\\tfrac {pq}{2}}}\n\n since θ is 90°.",
            "The area can be also expressed in terms of bimedians as[16]",
            "where the lengths of the bimedians are m and n and the angle between them is φ.",
            "Bretschneider's formula[17][14] expresses the area in terms of the sides and two opposite angles:",
            "where the sides in sequence are a, b, c, d, where s is the semiperimeter, and A and C are two (in fact, any two) opposite angles. This reduces to Brahmagupta's formula for the area of a cyclic quadrilateral—when A + C = 180° .",
            "Another area formula in terms of the sides and angles, with angle C being between sides b and c, and A being between sides a and d, is",
            "In the case of a cyclic quadrilateral, the latter formula becomes \n\n\n\nK\n=\n\n\n\n1\n2\n\n\n\n(\na\nd\n+\nb\nc\n)\nsin\n⁡\n\nA\n\n.\n\n\n{\\displaystyle K={\\tfrac {1}{2}}(ad+bc)\\sin {A}.}",
            "In a parallelogram, where both pairs of opposite sides and angles are equal, this formula reduces to \n\n\n\nK\n=\na\nb\n⋅\nsin\n⁡\n\nA\n\n.\n\n\n{\\displaystyle K=ab\\cdot \\sin {A}.}",
            "Alternatively, we can write the area in terms of the sides and the intersection angle θ of the diagonals, as long θ is not 90°:[18]",
            "In the case of a parallelogram, the latter formula becomes \n\n\n\nK\n=\n\n\n\n1\n2\n\n\n\n\n|\n\ntan\n⁡\nθ\n\n|\n\n⋅\n\n|\n\n\na\n\n2\n\n\n−\n\nb\n\n2\n\n\n\n|\n\n.\n\n\n{\\displaystyle K={\\tfrac {1}{2}}\\left|\\tan \\theta \\right|\\cdot \\left|a^{2}-b^{2}\\right|.}",
            "Another area formula including the sides a, b, c, d is[16]",
            "where x is the distance between the midpoints of the diagonals, and φ is the angle between the bimedians.",
            "The last trigonometric area formula including the sides a, b, c, d and the angle α (between a and b) is:[19]",
            "which can also be used for the area of a concave quadrilateral (having the concave part opposite to angle α), by just changing the first sign + to -.",
            "The following two formulas express the area in terms of the sides a, b, c and d, the semiperimeter s, and the diagonals p, q:",
            "The first reduces to Brahmagupta's formula in the cyclic quadrilateral case, since then pq = ac + bd.",
            "The area can also be expressed in terms of the bimedians m, n and the diagonals p, q:",
            "In fact, any three of the four values m, n, p, and q suffice for determination of the area, since in any quadrilateral the four values are related by \n\n\n\n\np\n\n2\n\n\n+\n\nq\n\n2\n\n\n=\n2\n(\n\nm\n\n2\n\n\n+\n\nn\n\n2\n\n\n)\n.\n\n\n{\\displaystyle p^{2}+q^{2}=2(m^{2}+n^{2}).}\n\n[24]: p. 126  The corresponding expressions are:[25]",
            "if the lengths of two bimedians and one diagonal are given, and[25]",
            "if the lengths of two diagonals and one bimedian are given.",
            "The area of a quadrilateral ABCD can be calculated using vectors. Let vectors AC and BD form the diagonals from A to C and from B to D. The area of the quadrilateral is then",
            "which is half the magnitude of the cross product of vectors AC and BD. In two-dimensional Euclidean space, expressing vector AC as a free vector in Cartesian space equal to (x1,y1) and BD as (x2,y2), this can be rewritten as:",
            "In the following table it is listed if the diagonals in some of the most basic quadrilaterals bisect each other, if their diagonals are perpendicular, and if their diagonals have equal length.[26] The list applies to the most general cases, and excludes named subsets.",
            "The lengths of the diagonals in a convex quadrilateral ABCD can be calculated using the law of cosines on each triangle formed by one diagonal and two sides of the quadrilateral. Thus",
            "and",
            "Other, more symmetric formulas for the lengths of the diagonals, are[27]",
            "and",
            "In any convex quadrilateral ABCD, the sum of the squares of the four sides is equal to the sum of the squares of the two diagonals plus four times the square of the line segment connecting the midpoints of the diagonals. Thus",
            "where x is the distance between the midpoints of the diagonals.[24]: p.126  This is sometimes known as Euler's quadrilateral theorem and is a generalization of the parallelogram law.",
            "The German mathematician Carl Anton Bretschneider derived in 1842 the following generalization of Ptolemy's theorem, regarding the product of the diagonals in a convex quadrilateral[28]",
            "This relation can be considered to be a law of cosines for a quadrilateral. In a cyclic quadrilateral, where A + C = 180°, it reduces to pq = ac + bd. Since cos (A + C) ≥ −1, it also gives a proof of Ptolemy's inequality.",
            "If X and Y are the feet of the normals from B and D to the diagonal AC = p in a convex quadrilateral ABCD with sides a = AB, b = BC, c = CD, d = DA, then[29]: p.14",
            "In a convex quadrilateral ABCD with sides a = AB, b = BC, c = CD, d = DA, and where the diagonals intersect at E,",
            "where e = AE, f = BE, g = CE, and h = DE.[30]",
            "The shape and size of a convex quadrilateral are fully determined by the lengths of its sides in sequence and of one diagonal between two specified vertices.  The two diagonals p, q and the four side lengths a, b, c, d of a quadrilateral are related[14] by the Cayley-Menger determinant, as follows:",
            "The internal angle bisectors of a convex quadrilateral either form a cyclic quadrilateral[24]: p.127  (that is, the four intersection points of adjacent angle bisectors are concyclic) or they are concurrent. In the latter case the quadrilateral is a tangential quadrilateral.",
            "In quadrilateral ABCD, if the angle bisectors of A and C meet on diagonal BD, then the angle bisectors of B and D meet on diagonal AC.[31]",
            "The bimedians of a quadrilateral are the line segments connecting the midpoints of the opposite sides. The intersection of the bimedians is the centroid of the vertices of the quadrilateral.[14]",
            "The midpoints of the sides of any quadrilateral (convex, concave or crossed) are the vertices of a parallelogram called the Varignon parallelogram. It has the following properties:",
            "The two bimedians in a quadrilateral and the line segment joining the midpoints of the diagonals in that quadrilateral are concurrent and are all bisected by their point of intersection.[24]: p.125",
            "In a convex quadrilateral with sides a, b, c and d, the length of the bimedian that connects the midpoints of the sides a and c is",
            "where p and q are the length of the diagonals.[33] The length of the bimedian that connects the midpoints of the sides b and d is",
            "Hence[24]: p.126",
            "This is also a corollary to the parallelogram law applied in the Varignon parallelogram.",
            "The lengths of the bimedians can also be expressed in terms of two opposite sides and the distance x between the midpoints of the diagonals. This is possible when using Euler's quadrilateral theorem in the above formulas. Whence[23]",
            "and",
            "Note that the two opposite sides in these formulas are not the two that the bimedian connects.",
            "In a convex quadrilateral, there is the following dual connection between the bimedians and the diagonals:[29]",
            "The four angles of a simple quadrilateral ABCD satisfy the following identities:[34]",
            "and",
            "Also,[35]",
            "In the last two formulas, no angle is allowed to be a right angle, since tan 90° is not defined.",
            "Let \n\n\n\na\n\n\n{\\displaystyle a}\n\n, \n\n\n\nb\n\n\n{\\displaystyle b}\n\n, \n\n\n\nc\n\n\n{\\displaystyle c}\n\n, \n\n\n\nd\n\n\n{\\displaystyle d}\n\n be the sides of a convex quadrilateral, \n\n\n\ns\n\n\n{\\displaystyle s}\n\n is the semiperimeter, \nand  \n\n\n\nA\n\n\n{\\displaystyle A}\n\n and \n\n\n\nC\n\n\n{\\displaystyle C}\n\n are opposite angles, then[36]",
            "and",
            "We can use these identities to derive the Bretschneider's Formula.",
            "If a convex quadrilateral has the consecutive sides a, b, c, d and the diagonals p, q, then its area K satisfies[37]",
            "From Bretschneider's formula it directly follows that the area of a quadrilateral satisfies",
            "with equality if and only if the quadrilateral is cyclic or degenerate such that one side is equal to the sum of the other three (it has collapsed into a line segment, so the area is zero).",
            "Also,",
            "with equality for a bicentric quadrilateral or a rectangle.",
            "The area of any quadrilateral also satisfies the inequality[38]",
            "Denoting the perimeter as L, we have[38]: p.114",
            "with equality only in the case of a square.",
            "The area of a convex quadrilateral also satisfies",
            "for diagonal lengths p and q, with equality if and only if the diagonals are perpendicular.",
            "Let a, b, c, d be the lengths of the sides of a convex quadrilateral ABCD with the area K and diagonals AC = p, BD = q. Then[39]",
            "Let a, b, c, d be the lengths of the sides of a convex quadrilateral ABCD with the area K, then the following inequality holds:[40]",
            "A corollary to Euler's quadrilateral theorem is the inequality",
            "where equality holds if and only if the quadrilateral is a parallelogram.",
            "Euler also generalized Ptolemy's theorem, which is an equality in a cyclic quadrilateral, into an inequality for a convex quadrilateral. It states that",
            "where there is equality if and only if the quadrilateral is cyclic.[24]: p.128–129  This is often called Ptolemy's inequality.",
            "In any convex quadrilateral the bimedians m, n and the diagonals p, q are related by the inequality",
            "with equality holding if and only if the diagonals are equal.[41]: Prop.1  This follows directly from the quadrilateral identity \n\n\n\n\nm\n\n2\n\n\n+\n\nn\n\n2\n\n\n=\n\n\n\n1\n2\n\n\n\n(\n\np\n\n2\n\n\n+\n\nq\n\n2\n\n\n)\n.\n\n\n{\\displaystyle m^{2}+n^{2}={\\tfrac {1}{2}}(p^{2}+q^{2}).}",
            "The sides a, b, c, and d of any quadrilateral satisfy[42]: p.228, #275",
            "and[42]: p.234, #466",
            "Among all quadrilaterals with a given perimeter, the one with the largest area is the square. This is called the isoperimetric theorem for quadrilaterals. It is a direct consequence of the area inequality[38]: p.114",
            "where K is the area of a convex quadrilateral with perimeter L. Equality holds if and only if the quadrilateral is a square. The dual theorem states that of all quadrilaterals with a given area, the square has the shortest perimeter.",
            "The quadrilateral with given side lengths that has the maximum area is the cyclic quadrilateral.[43]",
            "Of all convex quadrilaterals with given diagonals, the orthodiagonal quadrilateral has the largest area.[38]: p.119  This is a direct consequence of the fact that the area of a convex quadrilateral satisfies",
            "where θ is the angle between the diagonals p and q. Equality holds if and only if θ = 90°.",
            "If P is an interior point in a convex quadrilateral ABCD, then",
            "From this inequality it follows that the point inside a quadrilateral that minimizes the sum of distances to the vertices is the intersection of the diagonals. Hence that point is the Fermat point of a convex quadrilateral.[44]: p.120",
            "The centre of a quadrilateral can be defined in several different ways. The \"vertex centroid\" comes from considering the quadrilateral as being empty but having equal masses at its vertices. The \"side centroid\" comes from considering the sides to have constant mass per unit length. The usual centre, called just centroid (centre of area) comes from considering the surface of the quadrilateral as having constant density. These three points are in general not all the same point.[45]",
            "The \"vertex centroid\" is the intersection of the two bimedians.[46] As with any polygon, the x and y coordinates of the vertex centroid are the arithmetic means of the x and y coordinates of the vertices.",
            "The \"area centroid\" of quadrilateral ABCD can be constructed in the following way. Let Ga, Gb, Gc, Gd be the centroids of triangles BCD, ACD, ABD, ABC respectively. Then the \"area centroid\" is the intersection of the lines GaGc and GbGd.[47]",
            "In a general convex quadrilateral ABCD, there are no natural analogies to the circumcenter and orthocenter of a triangle. But two such points can be constructed in the following way. Let Oa, Ob, Oc, Od be the circumcenters of triangles BCD, ACD, ABD, ABC respectively; and denote by Ha, Hb, Hc, Hd the orthocenters in the same triangles. Then the intersection of the lines OaOc and ObOd is called the quasicircumcenter, and the intersection of the lines HaHc and HbHd is called the quasiorthocenter of the convex quadrilateral.[47] These points can be used to define an Euler line of a quadrilateral. In a convex quadrilateral, the quasiorthocenter H, the \"area centroid\" G, and the quasicircumcenter O are collinear in this order, and HG = 2GO.[47]",
            "There can also be defined a quasinine-point center E as the intersection of the lines EaEc and EbEd, where Ea, Eb, Ec, Ed are the nine-point centers of triangles BCD, ACD, ABD, ABC respectively. Then E is the midpoint of OH.[47]",
            "Another remarkable line in a convex non-parallelogram quadrilateral is the Newton line, which connects the midpoints of the diagonals, the segment connecting these points being bisected by the vertex centroid. One more interesting line (in some sense dual to the Newton's one) is the line connecting the point of intersection of diagonals with the vertex centroid. The line is remarkable by the fact that it contains the (area) centroid. The vertex centroid divides the segment connecting the intersection of diagonals and the (area) centroid in the ratio 3:1.[48]",
            "For any quadrilateral ABCD with points P and Q the intersections of AD and BC and AB and CD, respectively, the circles (PAB), (PCD), (QAD), and (QBC) pass through a common point M, called a Miquel point.[49]",
            "For a convex quadrilateral ABCD in which E is the point of intersection of the diagonals and F is the point of intersection of the extensions of sides BC and AD, let ω be a circle through E and F which meets CB internally at M and DA internally at N. Let CA meet ω again at L and let DB meet ω again at K. Then there holds: the straight lines NK and ML intersect at point P that is located on the side AB; the straight lines NL and KM intersect at point Q that is located on the side CD. \nPoints P and Q are called \"Pascal points\" formed by circle ω on sides AB and CD.\n[50]\n[51]\n[52]",
            "A hierarchical taxonomy of quadrilaterals is illustrated by the figure to the right. Lower classes are special cases of higher classes they are connected to. Note that \"trapezoid\" here is referring to the North American definition (the British equivalent is a trapezium). Inclusive definitions are used throughout.",
            "A non-planar quadrilateral is called a skew quadrilateral. Formulas to compute its dihedral angles from the edge lengths and the angle between two adjacent edges were derived for work on the properties of molecules such as cyclobutane that contain a \"puckered\" ring of four atoms.[55] Historically the term gauche quadrilateral was also used to mean a skew quadrilateral.[56] A skew  quadrilateral together with its diagonals form a (possibly non-regular) tetrahedron, and conversely every skew quadrilateral comes from a tetrahedron where a pair of opposite edges is removed."
        ]
    },
    {
        "title": "Euclidean geometry",
        "content": [
            "Euclidean geometry is a mathematical system attributed to ancient Greek mathematician Euclid, which he described in his textbook on geometry, Elements. Euclid's approach consists in assuming a small set of intuitively appealing axioms (postulates) and deducing many other propositions (theorems) from these. Although many of Euclid's results had been stated earlier,[1] Euclid was the first to organize these propositions into a logical system in which each result is proved from axioms and previously proved theorems.[2]",
            "The Elements begins with plane geometry, still taught in secondary school (high school) as the first axiomatic system and the first examples of mathematical proofs. It goes on to the solid geometry of three dimensions. Much of the Elements states results of what are now called algebra and number theory, explained in geometrical language.[1]",
            "For more than two thousand years, the adjective \"Euclidean\" was unnecessary because\nEuclid's axioms seemed so intuitively obvious (with the possible exception of the parallel postulate) that theorems proved from them were deemed absolutely true, and thus no other sorts of geometry were possible. Today, however, many other self-consistent non-Euclidean geometries are known, the first ones having been discovered in the early 19th century. An implication of Albert Einstein's theory of general relativity is that physical space itself is not Euclidean, and Euclidean space is a good approximation for it only over short distances (relative to the strength of the gravitational field).[3]",
            "Euclidean geometry is an example of synthetic geometry, in that it proceeds logically from axioms describing basic properties of geometric objects such as points and lines, to propositions about those objects. This is in contrast to analytic geometry, introduced almost 2,000 years later by René Descartes, which uses coordinates to express geometric properties by means of algebraic formulas.",
            "The Elements is mainly a systematization of earlier knowledge of geometry. Its improvement over earlier treatments was rapidly recognized, with the result that there was little interest in preserving the earlier ones, and they are now nearly all lost.",
            "There are 13 books in the Elements:",
            "Books I–IV and VI discuss plane geometry. Many results about plane figures are proved, for example, \"In any triangle, two angles taken together in any manner are less than two right angles.\" (Book I proposition 17) and the Pythagorean theorem \"In right-angled triangles the square on the side subtending the right angle is equal to the squares on the sides containing the right angle.\" (Book I, proposition 47)",
            "Books V and VII–X deal with number theory, with numbers treated geometrically as lengths of line segments or areas of surface regions. Notions such as prime numbers and rational and irrational numbers are introduced. It is proved that there are infinitely many prime numbers.",
            "Books XI–XIII concern solid geometry. A typical result is the 1:3 ratio between the volume of a cone and a cylinder with the same height and base. The platonic solids are constructed.",
            "Euclidean geometry is an axiomatic system, in which all theorems (\"true statements\") are derived from a small number of simple axioms. Until the advent of non-Euclidean geometry, these axioms were considered to be obviously true in the physical world, so that all the theorems would be equally true. However, Euclid's reasoning from assumptions to conclusions remains valid independently from the physical reality.[4]",
            "Near the beginning of the first book of the Elements, Euclid gives five postulates (axioms) for plane geometry, stated in terms of constructions (as translated by Thomas Heath):[5]",
            "Although Euclid explicitly only asserts the existence of the constructed objects, in his reasoning he also implicitly assumes them to be unique.",
            "The Elements also include the following five \"common notions\":",
            "Modern scholars agree that Euclid's postulates do not provide the complete logical foundation that Euclid required for his presentation.[6] Modern treatments use more extensive and complete sets of axioms.",
            "To the ancients, the parallel postulate seemed less obvious than the others. They aspired to create a system of absolutely certain propositions, and to them, it seemed as if the parallel line postulate required proof from simpler statements. It is now known that such a proof is impossible since one can construct consistent systems of geometry (obeying the other axioms) in which the parallel postulate is true, and others in which it is false.[7] Euclid himself seems to have considered it as being qualitatively different from the others, as evidenced by the organization of the Elements: his first 28 propositions are those that can be proved without it.",
            "Many alternative axioms can be formulated which are logically equivalent to the parallel postulate (in the context of the other axioms). For example, Playfair's axiom states:",
            "The \"at most\" clause is all that is needed since it can be proved from the remaining axioms that at least one parallel line exists.",
            "Euclidean Geometry is constructive. Postulates 1, 2, 3, and 5 assert the existence and uniqueness of certain geometric figures, and these assertions are of a constructive nature: that is, we are not only told that certain things exist, but are also given methods for creating them with no more than a compass and an unmarked straightedge.[8] In this sense, Euclidean geometry is more concrete than many modern axiomatic systems such as set theory, which often assert the existence of objects without saying how to construct them, or even assert the existence of objects that cannot be constructed within the theory.[9] Strictly speaking, the lines on paper are models of the objects defined within the formal system, rather than instances of those objects. For example, a Euclidean straight line has no width, but any real drawn line will have. Though nearly all modern mathematicians consider nonconstructive proofs just as sound as constructive ones, they are often considered less elegant, intuitive, or practically useful. Euclid's constructive proofs often supplanted fallacious nonconstructive ones, e.g. some Pythagorean proofs that assumed all numbers are rational, usually requiring a statement such as \"Find the greatest common measure of ...\"[10]",
            "Euclid often used proof by contradiction.[11]",
            "Points are customarily named using capital letters of the alphabet. Other figures, such as lines, triangles, or circles, are named by listing a sufficient number of points to pick them out unambiguously from the relevant figure, e.g., triangle ABC would typically be a triangle with vertices at points A, B, and C.",
            "Angles whose sum is a right angle are called complementary. Complementary angles are formed when a ray shares the same vertex and is pointed in a direction that is in between the two original rays that form the right angle. The number of rays in between the two original rays is infinite.",
            "Angles whose sum is a straight angle are supplementary. Supplementary angles are formed when a ray shares the same vertex and is pointed in a direction that is in between the two original rays that form the straight angle (180 degree angle). The number of rays in between the two original rays is infinite.",
            "In modern terminology, angles would normally be measured in degrees or radians.",
            "Modern school textbooks often define separate figures called lines (infinite), rays (semi-infinite), and line segments (of finite length). Euclid, rather than discussing a ray as an object that extends to infinity in one direction, would normally use locutions such as \"if the line is extended to a sufficient length\", although he occasionally referred to \"infinite lines\". A \"line\" for Euclid could be either straight or curved, and he used the more specific term \"straight line\" when necessary.",
            "The pons asinorum (bridge of asses) states that in isosceles triangles the angles at the base equal one another, and, if the equal straight lines are produced further, then the angles under the base equal one another.[12] Its name may be attributed to its frequent role as the first real test in the Elements of the intelligence of the reader and as a bridge to the harder propositions that followed. It might also be so named because of the geometrical figure's resemblance to a steep bridge that only a sure-footed donkey could cross.[13]",
            "Triangles are congruent if they have all three sides equal (SSS), two sides and the angle between them equal (SAS), or two angles and a side equal (ASA) (Book I, propositions 4, 8, and 26). Triangles with three equal angles (AAA) are similar, but not necessarily congruent. Also, triangles with two equal sides and an adjacent angle are not necessarily equal or congruent.",
            "The sum of the angles of a triangle is equal to a straight angle (180 degrees).[14] This causes an equilateral triangle to have three interior angles of 60 degrees. Also, it causes every triangle to have at least two acute angles and up to one obtuse or right angle.",
            "The celebrated Pythagorean theorem (book I, proposition 47) states that in any right triangle, the area of the square whose side is the hypotenuse (the side opposite the right angle) is equal to the sum of the areas of the squares whose sides are the two legs (the two sides that meet at a right angle).",
            "Thales' theorem, named after Thales of Miletus states that if A, B, and C are points on a circle where the line AC is a diameter of the circle, then the angle ABC is a right angle. Cantor supposed that Thales proved his theorem by means of Euclid Book I, Prop. 32 after the manner of Euclid Book III, Prop. 31.[15][16]",
            "In modern terminology, the area of a plane figure is proportional to the square of any of its linear dimensions, \n\n\n\nA\n∝\n\nL\n\n2\n\n\n\n\n{\\displaystyle A\\propto L^{2}}\n\n, and the volume of a solid to the cube, \n\n\n\nV\n∝\n\nL\n\n3\n\n\n\n\n{\\displaystyle V\\propto L^{3}}\n\n. Euclid proved these results in various special cases such as the area of a circle[17] and the volume of a parallelepipedal solid.[18] Euclid determined some, but not all, of the relevant constants of proportionality. For instance, it was his successor Archimedes who proved that a sphere has 2/3 the volume of the circumscribing cylinder.[19]",
            "Euclidean geometry has two fundamental types of measurements: angle and distance. The angle scale is absolute, and Euclid uses the right angle as his basic unit, so that, for example, a 45-degree angle would be referred to as half of a right angle. The distance scale is relative; one arbitrarily picks a line segment with a certain nonzero length as the unit, and other distances are expressed in relation to it. Addition of distances is represented by a construction in which one line segment is copied onto the end of another line segment to extend its length, and similarly for subtraction.",
            "Measurements of area and volume are derived from distances. For example, a rectangle with a width of 3 and a length of 4 has an area that represents the product, 12. Because this geometrical interpretation of multiplication was limited to three dimensions, there was no direct way of interpreting the product of four or more numbers, and Euclid avoided such products, although they are implied, for example in the proof of book IX, proposition 20.",
            "Euclid refers to a pair of lines, or a pair of planar or solid figures, as \"equal\" (ἴσος) if their lengths, areas, or volumes are equal respectively, and similarly for angles. The stronger term \"congruent\" refers to the idea that an entire figure is the same size and shape as another figure. Alternatively, two figures are congruent if one can be moved on top of the other so that it matches up with it exactly. (Flipping it over is allowed.) Thus, for example, a 2x6 rectangle and a 3x4 rectangle are equal but not congruent, and the letter R is congruent to its mirror image. Figures that would be congruent except for their differing sizes are referred to as similar. Corresponding angles in a pair of similar shapes are equal and corresponding sides are in proportion to each other.",
            "Because of Euclidean geometry's fundamental status in mathematics, it is impractical to give more than a representative sampling of applications here.",
            "As suggested by the etymology of the word, one of the earliest reasons for interest in and also one of the most common current uses of geometry is surveying.[20] In addition it has been used in classical mechanics and the cognitive and computational approaches to visual perception of objects. Certain practical results from Euclidean geometry (such as the right-angle property of the 3-4-5 triangle) were used long before they were proved formally.[21] The fundamental types of measurements in Euclidean geometry are distances and angles, both of which can be measured directly by a surveyor. Historically, distances were often measured by chains, such as Gunter's chain, and angles using graduated circles and, later, the theodolite.",
            "An application of Euclidean solid geometry is the determination of packing arrangements, such as the problem of finding the most efficient packing of spheres in n dimensions. This problem has applications in error detection and correction.",
            "Geometry is used extensively in architecture.",
            "Geometry can be used to design origami. Some classical construction problems of geometry are impossible using compass and straightedge, but can be solved using origami.[22]",
            "Archimedes (c. 287 BCE – c. 212 BCE), a colorful figure about whom many historical anecdotes are recorded, is remembered along with Euclid as one of the greatest of ancient mathematicians. Although the foundations of his work were put in place by Euclid, his work, unlike Euclid's, is believed to have been entirely original.[23] He proved equations for the volumes and areas of various figures in two and three dimensions, and enunciated the Archimedean property of finite numbers.",
            "Apollonius of Perga (c. 240 BCE – c. 190 BCE) is mainly known for his investigation of conic sections.",
            "René Descartes (1596–1650) developed analytic geometry, an alternative method for formalizing geometry which focused on turning geometry into algebra.[24]",
            "In this approach, a point on a plane is represented by its Cartesian (x, y) coordinates, a line is represented by its equation, and so on.",
            "In Euclid's original approach, the Pythagorean theorem follows from Euclid's axioms. In the Cartesian approach, the axioms are the axioms of algebra, and the equation expressing the Pythagorean theorem is then a definition of one of the terms in Euclid's axioms, which are now considered theorems.",
            "The equation",
            "defining the distance between two points P = (px, py) and Q = (qx, qy) is then known as the Euclidean metric, and other metrics define non-Euclidean geometries.",
            "In terms of analytic geometry, the restriction of classical geometry to compass and straightedge constructions means a restriction to first- and second-order equations, e.g., y = 2x + 1 (a line), or x2 + y2 = 7 (a circle).",
            "Also in the 17th century, Girard Desargues, motivated by the theory of perspective, introduced the concept of idealized points, lines, and planes at infinity. The result can be considered as a type of generalized geometry, projective geometry, but it can also be used to produce proofs in ordinary Euclidean geometry in which the number of special cases is reduced.[25]",
            "Geometers of the 18th century struggled to define the boundaries of the Euclidean system. Many tried in vain to prove the fifth postulate from the first four. By 1763, at least 28 different proofs had been published, but all were found incorrect.[26]",
            "Leading up to this period, geometers also tried to determine what constructions could be accomplished in Euclidean geometry. For example, the problem of trisecting an angle with a compass and straightedge is one that naturally occurs within the theory, since the axioms refer to constructive operations that can be carried out with those tools. However, centuries of efforts failed to find a solution to this problem, until Pierre Wantzel published a proof in 1837 that such a construction was impossible. Other constructions that were proved impossible include doubling the cube and squaring the circle. In the case of doubling the cube, the impossibility of the construction originates from the fact that the compass and straightedge method involve equations whose order is an integral power of two,[27] while doubling a cube requires the solution of a third-order equation.",
            "Euler discussed a generalization of Euclidean geometry called affine geometry, which retains the fifth postulate unmodified while weakening postulates three and four in a way that eliminates the notions of angle (whence right triangles become meaningless) and of equality of length of line segments in general (whence circles become meaningless) while retaining the notions of parallelism as an equivalence relation between lines, and equality of length of parallel line segments (so line segments continue to have a midpoint).",
            "In the early 19th century, Carnot and Möbius systematically developed the use of signed angles and line segments as a way of simplifying and unifying results.[28]",
            "In the 1840s William Rowan Hamilton developed the quaternions, and John T. Graves and Arthur Cayley the octonions. These are normed algebras which extend the complex numbers. Later it was understood that the quaternions are also a Euclidean geometric system with four real Cartesian coordinates.[29] Cayley used quaternions to study rotations in 4-dimensional Euclidean space.[30]",
            "At mid-century Ludwig Schläfli developed the general concept of Euclidean space, extending Euclidean geometry to higher dimensions. He defined polyschemes, later called polytopes, which are the higher-dimensional analogues of polygons and polyhedra. He developed their theory and discovered all the regular polytopes, i.e. the \n\n\n\nn\n\n\n{\\displaystyle n}\n\n-dimensional analogues of regular polygons and Platonic solids. He found there are six regular convex polytopes in dimension four, and three in all higher dimensions.",
            "Hyper-tetrahedron\n5-point",
            "Hyper-octahedron\n8-point",
            "Hyper-cube\n16-point",
            "24-point",
            "Hyper-icosahedron\n120-point",
            "Hyper-dodecahedron\n600-point",
            "Schläfli performed this work in relative obscurity and it was published in full only posthumously in 1901. It had little influence until it was rediscovered and fully documented in 1948 by H.S.M. Coxeter.",
            "In 1878 William Kingdon Clifford introduced what is now termed geometric algebra, unifying Hamilton's quaternions with Hermann Grassmann's algebra and revealing the geometric nature of these systems, especially in four dimensions. The operations of geometric algebra have the effect of mirroring, rotating, translating, and mapping the geometric objects that are being modeled to new positions. The Clifford torus on the surface of the 3-sphere is the simplest and most symmetric flat embedding of the Cartesian product of two circles (in the same sense that the surface of a cylinder is \"flat\").",
            "The century's most influential development in geometry occurred when, around 1830, János Bolyai and Nikolai Ivanovich Lobachevsky separately published work on non-Euclidean geometry, in which the parallel postulate is not valid.[31] Since non-Euclidean geometry is provably relatively consistent with Euclidean geometry, the parallel postulate cannot be proved from the other postulates.",
            "In the 19th century, it was also realized that Euclid's ten axioms and common notions do not suffice to prove all of the theorems stated in the Elements. For example, Euclid assumed implicitly that any line contains at least two points, but this assumption cannot be proved from the other axioms, and therefore must be an axiom itself. The very first geometric proof in the Elements, shown in the figure above, is that any line segment is part of a triangle; Euclid constructs this in the usual way, by drawing circles around both endpoints and taking their intersection as the third vertex. His axioms, however, do not guarantee that the circles actually intersect, because they do not assert the geometrical property of continuity, which in Cartesian terms is equivalent to the completeness property of the real numbers. Starting with Moritz Pasch in 1882, many improved axiomatic systems for geometry have been proposed, the best known being those of Hilbert,[32] George Birkhoff,[33] and Tarski.[34]",
            "Einstein's theory of special relativity involves a four-dimensional space-time, the Minkowski space, which is non-Euclidean. This shows that non-Euclidean geometries, which had been introduced a few years earlier for showing that the parallel postulate cannot be proved, are also useful for describing the physical world.",
            "However, the three-dimensional \"space part\" of the Minkowski space remains the space of Euclidean geometry. This is not the case with general relativity, for which the geometry of the space part of space-time is not Euclidean geometry.[35] For example, if a triangle is constructed out of three rays of light, then in general the interior angles do not add up to 180 degrees due to gravity. A relatively weak gravitational field, such as the Earth's or the Sun's, is represented by a metric that is approximately, but not exactly, Euclidean. Until the 20th century, there was no technology capable of detecting these deviations in rays of light from Euclidean geometry, but Einstein predicted that such deviations would exist. They were later verified by observations such as the slight bending of starlight by the Sun during a solar eclipse in 1919, and such considerations are now an integral part of the software that runs the GPS system.[36]",
            "Euclid believed that his axioms were self-evident statements about physical reality. Euclid's proofs depend upon assumptions perhaps not obvious in Euclid's fundamental axioms,[37] in particular that certain movements of figures do not change their geometrical properties such as the lengths of sides and interior angles, the so-called Euclidean motions, which include translations, reflections and rotations of figures.[38] Taken as a physical description of space, postulate 2 (extending a line) asserts that space does not have holes or boundaries; postulate 4 (equality of right angles) says that space is isotropic and figures may be moved to any location while maintaining congruence; and postulate 5 (the parallel postulate) that space is flat (has no intrinsic curvature).[39]",
            "As discussed above, Albert Einstein's theory of relativity significantly modifies this view.",
            "The ambiguous character of the axioms as originally formulated by Euclid makes it possible for different commentators to disagree about some of their other implications for the structure of space, such as whether or not it is infinite[40] (see below) and what its topology is. Modern, more rigorous reformulations of the system[41] typically aim for a cleaner separation of these issues. Interpreting Euclid's axioms in the spirit of this more modern approach, axioms 1–4 are consistent with either infinite or finite space (as in elliptic geometry), and all five axioms are consistent with a variety of topologies (e.g., a plane, a cylinder, or a torus for two-dimensional Euclidean geometry).",
            "Euclid sometimes distinguished explicitly between \"finite lines\" (e.g., Postulate 2) and \"infinite lines\" (book I, proposition 12). However, he typically did not make such distinctions unless they were necessary. The postulates do not explicitly refer to infinite lines, although for example some commentators interpret postulate 3, existence of a circle with any radius, as implying that space is infinite.[40]",
            "The notion of infinitesimal quantities had previously been discussed extensively by the Eleatic School, but nobody had been able to put them on a firm logical basis, with paradoxes such as Zeno's paradox occurring that had not been resolved to universal satisfaction. Euclid used the method of exhaustion rather than infinitesimals.[42]",
            "Later ancient commentators, such as Proclus (410–485 CE), treated many questions about infinity as issues demanding proof and, e.g., Proclus claimed to prove the infinite divisibility of a line, based on a proof by contradiction in which he considered the cases of even and odd numbers of points constituting it.[43]",
            "At the turn of the 20th century, Otto Stolz, Paul du Bois-Reymond, Giuseppe Veronese, and others produced controversial work on non-Archimedean models of Euclidean geometry, in which the distance between two points may be infinite or infinitesimal, in the Newton–Leibniz sense.[44] Fifty years later, Abraham Robinson provided a rigorous logical foundation for Veronese's work.[45]",
            "Ancient geometers may have considered the parallel postulate – that two parallel lines do not ever intersect – less certain than the others because it makes a statement about infinitely remote regions of space, and so cannot be physically verified.[46]",
            "The modern formulation of proof by induction was not developed until the 17th century, but some later commentators consider it implicit in some of Euclid's proofs, e.g., the proof of the infinitude of primes.[47]",
            "Supposed paradoxes involving infinite series, such as Zeno's paradox, predated Euclid. Euclid avoided such discussions, giving, for example, the expression for the partial sums of the geometric series in IX.35 without commenting on the possibility of letting the number of terms become infinite.",
            "Euclid frequently used the method of proof by contradiction, and therefore the traditional presentation of Euclidean geometry assumes classical logic, in which every proposition is either true or false, i.e., for any proposition P, the proposition \"P or not P\" is automatically true.",
            "Placing Euclidean geometry on a solid axiomatic basis was a preoccupation of mathematicians for centuries.[48] The role of primitive notions, or undefined concepts, was clearly put forward by Alessandro Padoa of the Peano delegation at the 1900 Paris conference:[48][49]",
            "...when we begin to formulate the theory, we can imagine that the undefined symbols are completely devoid of meaning and that the unproved propositions are simply conditions imposed upon the undefined symbols.",
            "Then, the system of ideas that we have initially chosen is simply one interpretation of the undefined symbols; but..this interpretation can be ignored by the reader, who is free to replace it in his mind by another interpretation.. that satisfies the conditions...",
            "Logical questions thus become completely independent of empirical or psychological questions...",
            "The system of undefined symbols can then be regarded as the abstraction obtained from the specialized theories that result when...the system of undefined symbols is successively replaced by each of the interpretations...",
            "That is, mathematics is context-independent knowledge within a hierarchical framework. As said by Bertrand Russell:[50]",
            "If our hypothesis is about anything, and not about some one or more particular things, then our deductions constitute mathematics. Thus, mathematics may be defined as the subject in which we never know what we are talking about, nor whether what we are saying is true.",
            "Such foundational approaches range between foundationalism and formalism.",
            "Geometry is the science of correct reasoning on incorrect figures."
        ]
    }
]